src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_РучныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_РучныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ОграничениеОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ОграничениеОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_MP_ПоследниеВыгруженныеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_MP_ПоследниеВыгруженныеОстатки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Маркетплейс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_МП_Маркетплейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Али_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КарточкаМП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ЯМ_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ламода_РазмерыНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Сбер_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_АЛИ_Вариации</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_Ozon_Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ИС_МВМ_Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Набор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ИС_ВБ_ТипыТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_ВБ_ТипыТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СГТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КГТ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/ИС_ВБ_СерверЛокализация/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область РаботаСТоварами

#Область ОстаткиНаСкладахПродавца

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Функция ТекстЗапросаОстатков() Экспорт

	Текст =
	"ВЫБРАТЬ
	|	ИС_WB_РазмерыНоменклатур.Ссылка КАК ПолеСопоставления,
	|	ИС_WB_РазмерыНоменклатур.Владелец КАК НоменклатураWB,
	|	ИС_WB_РазмерыНоменклатур.Владелец.Код КАК nmId,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура КАК Номенклатура,
	|	ИС_WB_СоответствиеРазмеров.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка, &ПустаяУпаковка) КАК Упаковка,
	|	НЕ ИС_WB_СоответствиеРазмеров.Номенклатура ЕСТЬ NULL КАК ЕстьСопоставление,
	|	ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Номенклатура.ТипНоменклатуры, ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Набор) КАК ЭтоНабор,
	|	ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Числитель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка.Числитель, 1)
	|	КОНЕЦ / ВЫБОР
	|		КОГДА ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель = 0
	|			ТОГДА 1
	|		ИНАЧЕ ЕСТЬNULL(ИС_WB_СоответствиеРазмеров.Упаковка.Знаменатель, 1)
	|	КОНЕЦ КАК КоэффициентУпаковки
	|ПОМЕСТИТЬ ВТ_Сопоставление
	|ИЗ
	|	Справочник.ИС_WB_РазмерыНоменклатур КАК ИС_WB_РазмерыНоменклатур
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО (ИС_WB_РазмерыНоменклатур.Профиль = &Профиль)
	|			И ИС_WB_РазмерыНоменклатур.Ссылка = ИС_WB_СоответствиеРазмеров.РазмерWB
	|ГДЕ
	|	ИС_WB_РазмерыНоменклатур.Профиль = &Профиль
	|	И НЕ ИС_WB_РазмерыНоменклатур.ПометкаУдаления
	|	И ИС_WB_РазмерыНоменклатур.Владелец.ТипТовара В (&ТипТовара)";
	
	Текст = Текст + ";";
	
	Текст = Текст + ИС_МП_УправлениеОстатками.ТекстЗапросаОстатков();
	     
	Текст = Текст +
	"ВЫБРАТЬ
	|	ВТ_Сопоставление.ПолеСопоставления КАК РазмерWB,
	|	ВТ_Сопоставление.НоменклатураWB КАК НоменклатураWB,
	|	ВТ_Сопоставление.nmId КАК nmId,
	|	ВТ_Сопоставление.Номенклатура КАК Номенклатура,
	|	ВТ_Сопоставление.Характеристика КАК Характеристика,
	|	ВТ_Сопоставление.Упаковка КАК Упаковка,
	|	ВТ_Остатки.Свободно КАК Свободно,
	|	ВТ_Остатки.Резерв КАК Резерв,
	|	ВЫБОР
	|		КОГДА ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ИС_MP_ОграничениеОстатков.Остаток
	|	КОНЕЦ КАК СкрываемыйОстаток,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL КАК ЕстьСкрываемыйОстаток,
	|	ИС_MP_РучныеОстатки.Остаток КАК РучнойОстаток,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьРучнойОстаток,
	|	ВТ_Сопоставление.ЕстьСопоставление КАК ЕстьСопоставление,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0) КАК ПоследнийВыгруженныйОстаток,
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL КАК ЕстьПоследнийВыгруженныйОстаток
	|ИЗ
	|	ВТ_Сопоставление КАК ВТ_Сопоставление
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ВТ_Сопоставление.ПолеСопоставления = ВТ_Остатки.ПолеСопоставления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО (ИС_WB_ШтрихкодыРазмеров.Профиль = &Профиль)
	|			И ВТ_Сопоставление.ПолеСопоставления = ИС_WB_ШтрихкодыРазмеров.Размер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_РучныеОстатки КАК ИС_MP_РучныеОстатки
	|		ПО (ИС_MP_РучныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_РучныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.Склад КАК Справочник.ИС_ВБ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_РучныеОстатки.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)) = ВТ_Сопоставление.ПолеСопоставления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ОграничениеОстатков КАК ИС_MP_ОграничениеОстатков
	|		ПО (ИС_MP_ОграничениеОстатков.Профиль = &Профиль)
	|			И (ИС_MP_ОграничениеОстатков.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.Склад КАК Справочник.ИС_ВБ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ОграничениеОстатков.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)) = ВТ_Сопоставление.ПолеСопоставления)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_MP_ПоследниеВыгруженныеОстатки КАК ИС_MP_ПоследниеВыгруженныеОстатки
	|		ПО (ИС_MP_ПоследниеВыгруженныеОстатки.Профиль = &Профиль)
	|			И (ИС_MP_ПоследниеВыгруженныеОстатки.Маркетплейс = &Маркетплейс)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.Склад КАК Справочник.ИС_ВБ_Склады)) = &Склад)
	|			И ((ВЫРАЗИТЬ(ИС_MP_ПоследниеВыгруженныеОстатки.КарточкаМП КАК Справочник.ИС_WB_РазмерыНоменклатур)) = ВТ_Сопоставление.ПолеСопоставления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Сопоставление.ПолеСопоставления,
	|	ВТ_Сопоставление.НоменклатураWB,
	|	ВТ_Сопоставление.Номенклатура,
	|	ВТ_Сопоставление.ЕстьСопоставление,
	|	ВТ_Сопоставление.Характеристика,
	|	ВТ_Сопоставление.Упаковка,
	|	НЕ ИС_MP_РучныеОстатки.Остаток ЕСТЬ NULL,
	|	ВТ_Сопоставление.nmId,
	|	ИС_MP_РучныеОстатки.Остаток,
	|	ВЫБОР
	|		КОГДА ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL
	|			ТОГДА &КоличествоСкрываемогоОстатка
	|		ИНАЧЕ ИС_MP_ОграничениеОстатков.Остаток
	|	КОНЕЦ,
	|	НЕ ИС_MP_ОграничениеОстатков.Остаток ЕСТЬ NULL,
	|	ВТ_Остатки.Свободно,
	|	ВТ_Остатки.Резерв,
	|	ЕСТЬNULL(ИС_MP_ПоследниеВыгруженныеОстатки.Остаток, 0),
	|	НЕ ИС_MP_ПоследниеВыгруженныеОстатки.Остаток ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_Сопоставление.ЕстьСопоставление УБЫВ";
	
	Возврат Текст;
	
КонецФункции //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

//+ ИнфоСофт Ивонин К.А. 10.02.25 УА #92406
Процедура УстановитьПараметрыЗапросаОстатков(Запрос, Профиль, Склад) Экспорт

	Событие = ИмяСобытия("УстановитьПараметрыЗапросаОстатков");
	
	Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Профиль, "Организация");
	
	ПеречислениеМП = Перечисления.ИС_МП_Маркетплейсы.ВБ; 
	
	МассивПараметров = ИС_МП_УправлениеОстатками.МассивНастроекОстатков(ПеречислениеМП);
	
	Настройки = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, ПеречислениеМП, МассивПараметров); 
	
	РассчитыватьНесобранныеКомплекты = Ложь;
	ВыгружатьОстаткиВРазрезеОрганизации = Ложь;
	СкрываемыйОстаток = 0;
	
	Если Настройки.РассчитыватьНесобранныеКомплекты <> Неопределено Тогда
		РассчитыватьНесобранныеКомплекты = Настройки.РассчитыватьНесобранныеКомплекты;	
	КонецЕсли; 
	
	Если Настройки.ВыгружатьОстаткиВРазрезеОрганизации <> Неопределено Тогда
		ВыгружатьОстаткиВРазрезеОрганизации = Настройки.ВыгружатьОстаткиВРазрезеОрганизации;	
	КонецЕсли;

	Если Настройки.СкрываемыйОстаток <> Неопределено Тогда
		СкрываемыйОстаток = Настройки.СкрываемыйОстаток;	
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Профиль", Профиль);
	Запрос.УстановитьПараметр("Маркетплейс", ПеречислениеМП);
	Запрос.УстановитьПараметр("Склад", Склад); 
	Запрос.УстановитьПараметр("КоличествоСкрываемогоОстатка", СкрываемыйОстаток);
	Запрос.УстановитьПараметр("РассчитыватьНесобранныеКомплекты", РассчитыватьНесобранныеКомплекты);
	Запрос.УстановитьПараметр("ВыгружатьОстаткиВРазрезеОрганизации", ВыгружатьОстаткиВРазрезеОрганизации);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПустаяУпаковка", ИС_МП_СерверЛокализация.ПустаяСсылкаУпаковка());
	
	ТипТовара = Новый Массив;
	Заменитель = "ИЕРАРХИИ";
	ПараметрСклад = Неопределено;
	
	ЗапросНазначений = Новый Запрос;
	ЗапросНазначений.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(Назначения.Ссылка, ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)) КАК Назначение
	|ИЗ
	|	Справочник.ИС_ВБ_Склады.НаправленияДеятельности КАК ИС_ВБ_СкладыНаправленияДеятельности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Назначения КАК Назначения
	|		ПО ИС_ВБ_СкладыНаправленияДеятельности.НаправлениеДеятельности = Назначения.НаправлениеДеятельности И (Назначения.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|ГДЕ
	|	ИС_ВБ_СкладыНаправленияДеятельности.Ссылка = &Ссылка";
	
	ЗапросНазначений.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапросаНазначений = ЗапросНазначений.Выполнить();
	
	Назначения = Новый Массив;
	
	ВыборкаНазначения = РезультатЗапросаНазначений.Выбрать();
	
	Пока ВыборкаНазначения.Следующий() Цикл	
		Назначения.Добавить(ВыборкаНазначения.Назначение);
	КонецЦикла;
	
	Если Назначения.Количество() = 0 Тогда		
		Назначения = Справочники.Назначения.ПустаяСсылка();
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Назначение", Назначения);
	
	ЗапросСклада = Новый Запрос;
	ЗапросСклада.Текст = 
	"ВЫБРАТЬ
	|	ИС_ВБ_Склады.Ссылка КАК Ссылка,
	|	ИС_ВБ_Склады.ТипТовара КАК ТипТовара,
	|	ИС_ВБ_Склады.ИспользоватьКГТ КАК ИспользоватьКГТ,
	|	ИС_ВБ_Склады.ВыгружатьОстаткиИзГруппыСкладов КАК ВыгружатьОстаткиИзГруппыСкладов,
	|	ИС_ВБ_Склады.Склад КАК Склад,	
	|	ИС_ВБ_Склады.ОбщаяГруппаСкладов КАК ОбщаяГруппаСкладов,
	|	ИС_ВБ_СкладыГруппаСкладов.Склад КАК СкладГруппы
	|ИЗ
	|	Справочник.ИС_ВБ_Склады КАК ИС_ВБ_Склады
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИС_ВБ_Склады.ГруппаСкладов КАК ИС_ВБ_СкладыГруппаСкладов
	|		ПО ИС_ВБ_Склады.Ссылка = ИС_ВБ_СкладыГруппаСкладов.Ссылка
	|ГДЕ
	|	ИС_ВБ_Склады.Ссылка = &Ссылка
	|ИТОГИ ПО
	|	Ссылка";

	ЗапросСклада.УстановитьПараметр("Ссылка", Склад);
	
	РезультатЗапроса = ЗапросСклада.Выполнить();
	
	ВыборкаСклад = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСклад.Следующий() Цикл
		
		ТипТовара.Добавить(ВыборкаСклад.ТипТовара);
		Если ВыборкаСклад.ИспользоватьКГТ Тогда
			ТипТовара.Добавить(Перечисления.ИС_ВБ_ТипыТоваров.КГТ);	
		КонецЕсли;
				
		Если ВыборкаСклад.ВыгружатьОстаткиИзГруппыСкладов Тогда 
		    
		    ПараметрСклад = Новый Массив;
		    
			ВыборкаГруппаСкладов = ВыборкаСклад.Выбрать();
		
			Пока ВыборкаГруппаСкладов.Следующий() Цикл
			
				Если ВыборкаГруппаСкладов.СкладГруппы <> Null Тогда
			    	ПараметрСклад.Добавить(ВыборкаГруппаСкладов.СкладГруппы);
			    КонецЕсли;
			    
			КонецЦикла;				
		
		ИначеЕсли ЗначениеЗаполнено(ВыборкаСклад.ОбщаяГруппаСкладов) Тогда
			Заменитель = "";
			ПараметрСклад = ВыборкаСклад.ОбщаяГруппаСкладов;
		Иначе
			ПараметрСклад = ВыборкаСклад.Склад;
		КонецЕсли;
	
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТипТовара", ТипТовара);
	
	Если ЗначениеЗаполнено(Заменитель) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, Заменитель, "");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрСклад) Тогда
		Текст = СтрШаблон("Не заполнено сопоставление склада %1 (%2)", Склад, Профиль);
		ИС_МП_Сервер.ЗаписатьВЖРИСообщитьПользователю(Событие, Текст); 
	КонецЕсли;
	 
	Запрос.УстановитьПараметр("Склад1С", ПараметрСклад);
		
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 10.02.25 УА #92406

#КонецОбласти

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//+ ИнфоСофт Ивонин К.А. 03.02.25 УА #92406
Функция ИмяСобытия(Имя)
	Возврат "ИС.МП.ИС_ВБ_СерверЛокализация." + Имя;
КонецФункции //- ИнфоСофт Ивонин К.А. 03.02.25 УА #92406 

#КонецОбласти
